### Video Part - 9 -- Cleaning Data -  Casting Data Types and Handling Missing Values

In [12]:
import pandas as pd
import numpy as np

In [34]:
people = {
    'fname' : ['Corey', 'Suminder', 'Ankit', 'Ujjwal', np.nan, None, 'NA'],
    'lname' : ['Schafer', 'Singh', 'Bhola', np.nan, None, 'Missing', np.nan],
    'age' : [23, 34, 54, 12, np.nan, None, None]
}

In [35]:
ppl_df = pd.DataFrame(people)

In [36]:
ppl_df['email'] = ppl_df['fname'].str.lower() + ' ' + ppl_df['lname'].str.lower() + ' ' + '@company.org'

In [37]:
ppl_df

      fname    lname   age                        email
0     Corey  Schafer  23.0   corey schafer @company.org
1  Suminder    Singh  34.0  suminder singh @company.org
2     Ankit    Bhola  54.0     ankit bhola @company.org
3    Ujjwal      NaN  12.0                          NaN
4       NaN     None   NaN                          NaN
5      None  Missing   NaN                          NaN
6        NA      NaN   NaN                          NaN

In [38]:
ppl_df['salary'] = [np.random.randint(35000, 75000, len(ppl_df['fname'])) for x in range(len(ppl_df['fname']))]

In [39]:
ppl_df

,fname,lname,age,email,salary
0,Corey,Schafer,23.0,corey schafer @company.org,"[37467, 66832, 72234, 52338, 45646, 38544, 63304]"
1,Suminder,Singh,34.0,suminder singh @company.org,"[46156, 45957, 70353, 65740, 36400, 49019, 46215]"
2,Ankit,Bhola,54.0,ankit bhola @company.org,"[70786, 42713, 62581, 44055, 39015, 60026, 35210]"
3,Ujjwal,NaN,12.0,NaN,"[59511, 73701, 66869, 49219, 41642, 71813, 44352]"
4,NaN,None,NaN,NaN,"[42009, 38206, 39477, 64186, 46457, 37111, 41056]"
5,None,Missing,NaN,NaN,"[74495, 36318, 51930, 44901, 41582, 57533, 40581]"
6,NA,NaN,NaN,NaN,"[42576, 52519, 48997, 67618, 47710, 72600, 35522]"

In [40]:
ppl_df['salary'] = [x for x in np.random.randint(35000, 75000, len(ppl_df['fname']))]

In [41]:
ppl_df

      fname    lname   age                        email  salary
0     Corey  Schafer  23.0   corey schafer @company.org   56561
1  Suminder    Singh  34.0  suminder singh @company.org   57390
2     Ankit    Bhola  54.0     ankit bhola @company.org   69051
3    Ujjwal      NaN  12.0                          NaN   41406
4       NaN     None   NaN                          NaN   71101
5      None  Missing   NaN                          NaN   53794
6        NA      NaN   NaN                          NaN   43632

In [42]:
ppl_df.loc[ppl_df['fname'] == 'Ujjwal','salary'] = None

In [43]:
ppl_df

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
3    Ujjwal      NaN  12.0                          NaN      NaN
4       NaN     None   NaN                          NaN  71101.0
5      None  Missing   NaN                          NaN  53794.0
6        NA      NaN   NaN                          NaN  43632.0

In [44]:
ppl_df.dropna(axis = 'index', how = 'all')

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
3    Ujjwal      NaN  12.0                          NaN      NaN
4       NaN     None   NaN                          NaN  71101.0
5      None  Missing   NaN                          NaN  53794.0
6        NA      NaN   NaN                          NaN  43632.0

In [45]:
ppl_df.dropna(axis = 'index', how = 'any')

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0

In [46]:
ppl_df.dropna(axis = 'columns', how = 'any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [47]:
ppl_df.dropna(axis = 'columns', how = 'all')

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
3    Ujjwal      NaN  12.0                          NaN      NaN
4       NaN     None   NaN                          NaN  71101.0
5      None  Missing   NaN                          NaN  53794.0
6        NA      NaN   NaN                          NaN  43632.0

In [48]:
ppl_df.dropna(axis = 'index', how = 'any', subset=['email']) 
# here all or any will not be any different, since it is a singlr column subset that we are using

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0

In [51]:
ppl_df.dropna(axis = 'index', how = 'all', subset=['email', 'lname'])
#here all will check for the listed columns in the subset arguement and if a row is found with both columns as none, it will be dropped

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
5      None  Missing   NaN                          NaN  53794.0

In [53]:
ppl_df.dropna(axis = 'index', how = 'any', subset=['email', 'lname'])
#will drop the rows if any of the subset columns has a null

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0

In [54]:
ppl_df.replace('NA', np.nan, inplace=True)
ppl_df.replace('Missing', np.nan, inplace=True)

In [55]:
ppl_df

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
3    Ujjwal      NaN  12.0                          NaN      NaN
4       NaN     None   NaN                          NaN  71101.0
5      None      NaN   NaN                          NaN  53794.0
6       NaN      NaN   NaN                          NaN  43632.0

In [57]:
ppl_df.isna()

   fname  lname    age  email  salary
0  False  False  False  False   False
1  False  False  False  False   False
2  False  False  False  False   False
3  False   True  False   True    True
4   True   True   True   True   False
5   True   True   True   True   False
6   True   True   True   True   False

In [58]:
ppl_df.fillna('MISSING')

      fname    lname      age                        email   salary
0     Corey  Schafer     23.0   corey schafer @company.org  56561.0
1  Suminder    Singh     34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola     54.0     ankit bhola @company.org  69051.0
3    Ujjwal  MISSING     12.0                      MISSING  MISSING
4   MISSING  MISSING  MISSING                      MISSING  71101.0
5   MISSING  MISSING  MISSING                      MISSING  53794.0
6   MISSING  MISSING  MISSING                      MISSING  43632.0

In [59]:
ppl_df.fillna(method='ffill')

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
3    Ujjwal    Bhola  12.0     ankit bhola @company.org  69051.0
4    Ujjwal    Bhola  12.0     ankit bhola @company.org  71101.0
5    Ujjwal    Bhola  12.0     ankit bhola @company.org  53794.0
6    Ujjwal    Bhola  12.0     ankit bhola @company.org  43632.0

In [60]:
ppl_df.fillna(0)

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
3    Ujjwal        0  12.0                            0      0.0
4         0        0   0.0                            0  71101.0
5         0        0   0.0                            0  53794.0
6         0        0   0.0                            0  43632.0

In [62]:
ppl_df.fillna({'fname' : 'XXX', 'lname' : 'YYY'})

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
3    Ujjwal      YYY  12.0                          NaN      NaN
4       XXX      YYY   NaN                          NaN  71101.0
5       XXX      YYY   NaN                          NaN  53794.0
6       XXX      YYY   NaN                          NaN  43632.0

In [64]:
ppl_df['age'].fillna(method = 'ffill', limit = 1)

0    23.0
1    34.0
2    54.0
3    12.0
4    12.0
5     NaN
6     NaN
Name: age, dtype: float64

In [65]:
ppl_df.dtypes

fname      object
lname      object
age       float64
email      object
salary    float64
dtype: object

In [66]:
type(np.nan)

float

In [70]:
ppl_df['age'] = ppl_df.age.astype(float)
# if df or series contains nan values, typecasting to a numerical variable will be possible only to a float value

In [71]:
ppl_df

      fname    lname   age                        email   salary
0     Corey  Schafer  23.0   corey schafer @company.org  56561.0
1  Suminder    Singh  34.0  suminder singh @company.org  57390.0
2     Ankit    Bhola  54.0     ankit bhola @company.org  69051.0
3    Ujjwal      NaN  12.0                          NaN      NaN
4       NaN     None   NaN                          NaN  71101.0
5      None      NaN   NaN                          NaN  53794.0
6       NaN      NaN   NaN                          NaN  43632.0

In [73]:
ppl_df.age.mean()

30.75

In [74]:
df = pd.read_csv('survey_results_public.csv')

In [75]:
df.isnull().sum()

Respondent          0
MainBranch        552
Hobbyist            0
OpenSourcer         0
OpenSource       2041
                ...
Sexuality       12736
Ethnicity       12215
Dependents       5824
SurveyLength     1899
SurveyEase       1802
Length: 85, dtype: int64

In [76]:
people = {
    'fname' : ['Corey', 'Suminder', 'Ankit', 'Ujjwal', np.nan, None, 'NA'],
    'lname' : ['Schafer', 'Singh', 'Bhola', np.nan, None, 'Missing', np.nan],
    'age' : [23, 34, 54, 12, np.nan, None, None]
}

df_tst2 = pd.DataFrame(people)

In [78]:
df_tst2.replace(np.nan, 0)

      fname    lname   age
0     Corey  Schafer  23.0
1  Suminder    Singh  34.0
2     Ankit    Bhola  54.0
3    Ujjwal        0  12.0
4         0        0   0.0
5         0  Missing   0.0
6        NA        0   0.0

In [80]:
df_tst2.to_csv('df_tst2.csv')

In [83]:
df2 = pd.read_csv('df_tst2.csv', na_values = ['NA', 'Missing'])

In [84]:
df2

   Unnamed: 0     fname    lname   age
0           0     Corey  Schafer  23.0
1           1  Suminder    Singh  34.0
2           2     Ankit    Bhola  54.0
3           3    Ujjwal      NaN  12.0
4           4       NaN      NaN   NaN
5           5       NaN      NaN   NaN
6           6       NaN      NaN   NaN

In [85]:
df2.reset_index(inplace=True)

In [86]:
df2

   index  Unnamed: 0     fname    lname   age
0      0           0     Corey  Schafer  23.0
1      1           1  Suminder    Singh  34.0
2      2           2     Ankit    Bhola  54.0
3      3           3    Ujjwal      NaN  12.0
4      4           4       NaN      NaN   NaN
5      5           5       NaN      NaN   NaN
6      6           6       NaN      NaN   NaN

In [88]:
df['YearsCode'].head(10)

0      4
1    NaN
2      3
3      3
4     16
5     13
6      6
7      8
8     12
9     12
Name: YearsCode, dtype: object

In [91]:
df.YearsCode.astype(float).mean()

ValueError: could not convert string to float: 'Less than 1 year'

In [93]:
df.YearsCode.unique()

array(['4', nan, '3', '16', '13', '6', '8', '12', '2', '5', '17', '10',
       '14', '35', '7', 'Less than 1 year', '30', '9', '26', '40', '19',
       '15', '20', '28', '25', '1', '22', '11', '33', '50', '41', '18',
       '34', '24', '23', '42', '27', '21', '36', '32', '39', '38', '31',
       '37', 'More than 50 years', '29', '44', '45', '48', '46', '43',
       '47', '49'], dtype=object)

In [94]:
df.YearsCode.nunique()

52

In [102]:
df[['YearsCode']].dtypes

YearsCode    object
dtype: object

In [106]:
df[df.YearsCode.isin([str(x) for x in range(0,100)])]

,Respondent,MainBranch,Hobbyist,OpenSourcer,OpenSource,Employment,Country,Student,EdLevel,UndergradMajor,...,WelcomeChange,SONewContent,Age,Gender,Trans,Sexuality,Ethnicity,Dependents,SurveyLength,SurveyEase
0,1,I am a student who is learning to code,Yes,Never,The quality of OSS and closed source software ...,"Not employed, and not looking for work",United Kingdom,No,Primary/elementary school,NaN,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,14.0,Man,No,Straight / Heterosexual,NaN,No,Appropriate in length,Neither easy nor difficult
2,3,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Thailand,No,"Bachelors degree (BA, BS, B.Eng., etc.)",Web development or web design,...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,28.0,Man,No,Straight / Heterosexual,NaN,Yes,Appropriate in length,Neither easy nor difficult
3,4,I am a developer by profession,No,Never,The quality of OSS and closed source software ...,Employed full-time,United States,No,"Bachelors degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,22.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
4,5,I am a developer by profession,Yes,Once a month or more often,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Ukraine,No,"Bachelors degree (BA, BS, B.Eng., etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,Tech meetups or events in your area;Courses on...,30.0,Man,No,Straight / Heterosexual,White or of European descent;Multiracial,No,Appropriate in length,Easy
5,6,"I am not primarily a developer, but I write co...",Yes,Never,The quality of OSS and closed source software ...,Employed full-time,Canada,No,"Bachelors degree (BA, BS, B.Eng., etc.)",Mathematics or statistics,...,Just as welcome now as I felt last year,Tech articles written by other developers;Indu...,28.0,Man,No,Straight / Heterosexual,East Asian,No,Too long,Neither easy nor difficult
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88872,87739,NaN,Yes,Less than once per year,"OSS is, on average, of HIGHER quality than pro...",Employed part-time,Czech Republic,"Yes, full-time","Masters degree (MA, MS, M.Eng., MBA, etc.)","Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,NaN,25.0,NaN,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
88875,88182,NaN,Yes,Once a month or more often,"OSS is, on average, of HIGHER quality than pro...",Employed part-time,Pakistan,NaN,"Secondary school (e.g. American high school, G...",NaN,...,Not applicable - I did not use Stack Overflow ...,Courses on technologies you're interested in,NaN,Man,No,Straight / Heterosexual,NaN,Yes,Too short,Neither easy nor difficult
88876,88212,NaN,No,Less than once per year,"OSS is, on average, of HIGHER quality than pro...",Employed full-time,Spain,No,"Secondary school (e.g. American high school, G...",NaN,...,NaN,Tech articles written by other developers;Indu...,40.0,Man,No,Straight / Heterosexual,White or of European descent,No,Appropriate in length,Easy
88877,88282,NaN,Yes,Once a month or more often,The quality of OSS and closed source software ...,"Not employed, but looking for work",United States,No,Some college/university study without earning ...,"Computer science, computer engineering, or sof...",...,Just as welcome now as I felt last year,NaN,NaN,Man,No,Straight / Heterosexual,NaN,No,Too short,Neither easy nor difficult
88882,88863,NaN,Yes,Less than once per year,"OSS is, on average, of HIGHER quality than pro...","Not employed, and not looking for work",Spain,"Yes, full-time","Professional degree (JD, MD, etc.)","Computer science, computer engineering, or sof...",...,Somewhat less welcome now than last year,Tech articles written by other developers;Indu...,18.0,Man,No,Straight / Heterosexual,Hispanic or Latino/Latina;White or of European...,No,Appropriate in length,Easy

In [107]:
df.shape

(88883, 85)

In [108]:
df.YearsCode.value_counts()

5                     7047
10                    6777
6                     6179
4                     5729
8                     5361
7                     5320
3                     5179
2                     3974
15                    3942
20                    3636
12                    3530
9                     3360
11                    2265
14                    2126
13                    2036
18                    1900
1                     1814
25                    1657
16                    1593
30                    1532
Less than 1 year      1367
17                    1349
19                    1018
22                    1016
35                     873
23                     745
21                     715
24                     693
40                     497
28                     465
32                     420
26                     409
27                     408
33                     353
38                     340
34                     327
37                     321
36                     308
29                     234
31                     202
39                     170
More than 50 years     126
42                     115
45                     113
41                      92
43                      83
44                      52
50                      51
47                      36
48                      31
46                      27
49                      25
Name: YearsCode, dtype: int64

In [109]:
df.YearsCode.isnull().sum()

945

In [111]:
df[df.YearsCode.isin([str(x) for x in range(0,100)])]['YearsCode'].astype(float).mean()

11.789195442188674

In [117]:
df.YearsCode.replace({'Less than 1 year' : 0, 'More than 50 years' : 51}).astype(float).mean()

11.662114216834588

In [118]:
df.YearsCode.replace({'Less than 1 year' : 0, 'More than 50 years' : 51}).astype(float).median()

9.0